// *
//      Закомментируй ненужные строки кода, чтобы на экран вывелась надпись:
//  2 плюс 3 равно 5
//Примечание: комментировать строку с объявлением нельзя число.
// * /
// Пример комментария

public  class  Main {
    public  static  void  main ( String [] args ) {
        int a =  3 ;
        int b =  2 ;

        //Система . из . печать ( " два " );
        System.out.println(b);
        System.out.println(" плюс ");
        //Система . из . печать ( " минус " );
        System.out.println(a);
        //Система . из . print ( " три " );
        System.out.println(" равно ");
        //Система . из . печать ( " будет " );
        System.out.println(" пять ");
        //Система . из . печать (а + б);
    }
}
